sdaiValidateAggrUni(Sdai_instS*,Sdai_Id_aggr*)
\details
Validates whether all the aggregate uniqueness constraints defined in the data dictionary
for the specified application instance are satisfied.
Retrieves the non-persistent list of those attributes that does not conform to the validation.
\param instance     [in]  Identifier of the application instance to be validated.
\param list         [out] An identifier of a pre-existing NPL to which the SdaiAttr identifiers of
those attributes are appended that do not conform to the validation.
\returns
* sdaiTRUE if all aggregate uniqueness is satisfied;
* sdaiFALSE if at least one aggregate uniqueness failed.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiVA_NSET - Value not set.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.